Функция ПолучитьОтчет(ЗапросHTTP) Экспорт
	
	ВидОтчета = ЗапросHTTP.ПараметрыЗапроса.Получить("type");
	
	Тело = ЗапросHTTP.ПолучитьТелоКакСтроку();
	
	Возврат ПолучитьPDFОтчета(ВидОтчета, Тело)
		
КонецФункции

#Область Печать

Функция ПолучитьPDFОтчета(ВидОтчета, Тело) Экспорт
	
	СтруктураТела = react_ОбщегоНазначения.ПолучитьСтруктуруИзJSON(Тело);
	
	Если ВидОтчета = "ОстаткиТоваров" ИЛИ ВидОтчета = "amountOfGoods" Тогда
		ТабличныйДокумент = Отчеты.ОстаткиТоваров.СФормироватьОтчет(Новый ТабличныйДокумент, Дата(СтруктураТела.paramDate));
	Иначе
		ТабличныйДокумент = Новый ТабличныйДокумент;
	КонецЕсли;
		
	//выравнивание по ширине
	ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	ТабличныйДокумент.АвтоМасштаб = Истина;
	ТабличныйДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_РА";

	BASEСтрока = ТабличныйДокументВСтроку(ТабличныйДокумент);
	
	СтруктураОтвета = Новый Структура("pdf_base64", BASEСтрока);
	
	Возврат react_ОбщегоНазначения.МассивСтруктурВJSON(СтруктураОтвета);
		
КонецФункции

Функция ТабличныйДокументВСтроку(ТабличныйДокумент) Экспорт
		
			
	ИмяФайла = ПолучитьИмяВременногоФайла("PDF");
	
	
	ТабличныйДокумент.Записать(ИмяФайла, ТипФайлаТабличногоДокумента.PDF);
		
	Данные = Новый ДвоичныеДанные(ИмяФайла);
	
	
	BASEСтрока = Base64Строка(Данные);
	
	
	ТабличныйДокумент = Неопределено;
	
	
	УдалитьФайлы(ИмяФайла);
	
	
	Возврат BASEСтрока;
			
	
КонецФункции

#КонецОбласти