
#Область Взаимодействия

Функция ВзаимодействияGetActions(Запрос)
			
	actions = react_Взаимодействия.ПолучитьВзаимодействия(Запрос);
	
	Возврат react_ОбщегоНазначения.СформироватьОтветJSON(actions, Запрос); 
	
КонецФункции

Функция ВзаимодействияPostActions(Запрос)

	Тело = Запрос.ПолучитьТелоКакСтроку();	
	СтруктураОтвета = react_Взаимодействия.СоздатьОбновитьДокумент(Тело);	
	
	Возврат react_ОбщегоНазначения.СформироватьОтветJSON_СозданиеОбновлениеВзаимодействия(СтруктураОтвета, Запрос);
	
КонецФункции

#КонецОбласти

#Область Аутентификация 

Функция АутентификацияPOSTSignIn(Запрос)
	
	Тело = Запрос.ПолучитьТелоКакСтроку();
	СтруктураОтвета = react_АутентификацияРегистрация.ПроверитьДанныеДляВхода(Тело);
		
	Возврат react_ОбщегоНазначения.СформироватьОтветJSON_Аутентификация(СтруктураОтвета, Запрос);
	
КонецФункции

Функция РегистрацияPOSTSignUp(Запрос)
	Ответ = Новый HTTPСервисОтвет(200);
	Возврат Ответ;
КонецФункции

#КонецОбласти

#Область Заказы

Функция ЗаказыGetOrders(Запрос)
	orders = react_Заказы.ПолучитьЗаказы(Запрос);
	
	Возврат react_ОбщегоНазначения.СформироватьОтветJSON_Заказы(orders, Запрос);
КонецФункции

#КонецОбласти

#Область Отчеты

Функция ОтчетыPOSTReport(Запрос)
	
	report = react_Отчеты.ПолучитьОтчет(Запрос);
	
	Возврат react_ОбщегоНазначения.СформироватьОтветJSON_Отчеты(report, Запрос);
КонецФункции


#КонецОбласти

#Область Пользователи

Функция ПользователиGetUsers(Запрос)
	
	users = react_Мессенджер.ПолучитьПользователей(Запрос);	
	
	Возврат react_ОбщегоНазначения.СформироватьОтветJSON_Пользователи(users, Запрос);
КонецФункции

#КонецОбласти


#Область Общие

Функция OPTIONS(Запрос)
	
	Ответ = Новый HTTPСервисОтвет(200);
	
	Origin = Запрос.Заголовки.Получить("Origin");
	Если Origin = Неопределено Тогда
		Ответ.Заголовки.Вставить("Access-Control-Allow-Origin", "*");
	Иначе
		Ответ.Заголовки.Вставить("Access-Control-Allow-Origin", Origin);
	КонецЕсли;
	Ответ.Заголовки.Вставить("Access-Control-Allow-Methods", "GET, PUT, POST, DELETE, HEAD, OPTIONS");
	Ответ.Заголовки.Вставить("Access-Control-Max-Age", "86400");
	Ответ.Заголовки.Вставить("Access-Control-Allow-Headers", "Access-Control-Allow-Headers, Origin,Accept, X-Requested-With, Content-Type, Access-Control-Request-Method, Access-Control-Request-Headers");
	
	Возврат Ответ;

КонецФункции

#КонецОбласти 