
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)

	ТабДок = РасходнаяНакладная(ПараметрКоманды);
	
	ТабДок.ОтображатьСетку = Ложь;
	ТабДок.Защита = Ложь;
	ТабДок.ТолькоПросмотр = Ложь;
	ТабДок.ОтображатьЗаголовки = Ложь; 
	ТабДок.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	ТабДок.АвтоМасштаб = Истина;
	ТабДок.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_РА";
	ТабДок.Показать();

КонецПроцедуры

&НаСервере
Функция РасходнаяНакладная(ПараметрКоманды)
	Возврат Документы.РасходнаяНакладная.СформироватьРасходнуюНакладную(ПараметрКоманды);
КонецФункции
